Repository: samuelgsrmgc/GeminiBot
Catalog: locales/*/LC_MESSAGES/messages.po
Languages: ru

source: Start New Conversation
ru: Начать новый диалог

source: Image Description
ru: Описание изображения

source: Chat History
ru: История чата

source: Hi. It's Gemini Chat Bot. You can ask me anything and talk to me about what you want
ru: Привет. Это чат-бот «Близнецы». Вы можете задать мне любой вопрос и поговорить со мной о том, что вас интересует.

source: Start Again
ru: Начать заново

source: You asked for a conversation. OK, Let's start conversation!
ru: Вы попросили начать разговор. Хорошо, давайте начнем!

source: You asked for a continue conversation. OK, Let's go!
ru: Вы попросили продолжить разговор. Хорошо, поехали!

source: Return to menu
ru: Вернуться в меню

source: Back to menu
ru: Назад в меню

source: Message is too long. Please shorten your message and try again.
ru: Сообщение слишком длинное. Пожалуйста, сократите свое сообщение и попробуйте еще раз.

source: Wait for response processing...
ru: Ожидайте обработку ответа...

source: Sorry, I couldn't find the history for this conversation. Let's start a new one.
ru: Извините, я не смог найти историю этой беседы. Давайте начнем новую.

source: Save and Back to menu
ru: Сохранить и вернуться в меню

source: Back to menu without saving
ru: Вернуться в меню без сохранения

source: You have exceeded your daily quota for requests. Please try again later.
ru: Вы превысили дневную квоту запросов. Пожалуйста, повторите попытку позже.

source: An error occurred while processing your message.
ru: Произошла ошибка при обработке вашего сообщения.

source: Conversation not found.
ru: Разговор не найден.

source: Continue Conversations
ru: Продолжить диалоги

source: Delete Conversation
ru: Удалить диалог

source: An error occurred while retrieving the conversation.
ru: Произошла ошибка при получении разговора.

source: No conversation selected for deletion.
ru: Не выбран разговор для удаления.

source: Could not delete the conversation. It may have been already deleted.
ru: Не удалось удалить разговор. Возможно, он уже был удален.

source: Conversation history deleted successfully. Back to menu Start new Conversation
ru: История диалогов успешно удалена. Назад в меню Начать новый диалог

source: An error occurred while deleting the conversation.
ru: Произошла ошибка при удалении разговора.

source: You asked for Image description. OK, Send your image with caption!
ru: Вы попросили описание изображения. Хорошо, отправьте свое изображение с подписью!

source: Image is too large. Please send an image smaller than 4MB.
ru: Изображение слишком большое. Пожалуйста, отправьте изображение размером менее 4 МБ.

source: Empty response from Gemini
ru: Пустой ответ от Gemini

source: Couldn't generate a response. Please try again.
ru: Не удалось сгенерировать ответ. Пожалуйста, попробуйте еще раз.

source: An error occurred while processing the image.
ru: Произошла ошибка при обработке изображения.

source: You have not any chat history
ru: У вас нет истории чатов

source: An error occurred while retrieving the conversation history.
ru: Произошла ошибка при получении истории разговоров.

source: Refresh
ru: Обновить

source: Until next time!
ru: До скорого!
